[{"topic": "Graduate Student Seminar Series", "description": "1992 - 1993 Graduate Student Seminar Series Schedule. This informal discussion series is your chance to meet graduate students and distinguished faculty from across campus and get a free lunch! Space is limited, so register-today by sending a list of sessions you wish to attend to John Hinshaw, 'hinshaw@andrew'.", "speaker": "Bennett Harrison", "tag": "Career", "file_name": "cmu.andrew.org.heinz-2478_4", "id": 1}, {"topic": "EPP Grad Seminar", "description": "The  high  performance  of   today's  computers  has  facilitated  the development  and  use  of  software  to simulate  realistic,  complex chemical   and  industrial  processes. Simulation  of  steady  state processes are  well  served  by packages  such as  PROCESS,  FLOWTRAN, CHEMSHARE, and  ASPEN. In addition, several  companies have in-house simulation  tools  catering  to   their  specific/proprietary   needs. However,   while computer   simulation   models   have   grown   in sophistication,  certain   capabilities  important  to   research  and development  planning,  systems  design  and  economic  analyses still remain in the stages of infancy. For example, the available simulation models   treat   the   design   variables   in  process   calculations deterministically. Such an approach  does not take into consideration the  implicit  and  explicit  uncertainties typically  associated with process  flowsheets,  especially  during  the early  stages of process development. The capability of  analyzing/simulating  processes  in a non-deterministic framework will, therefore, be of immense help to the practising engineer and the policy planner.  Our research  in this direction has led to  the  development of a { Stochastic Modeling} capability,  which is  implemented  in  the ASPEN process simulator. This provides a useful  tool  for  design, analysis and decision-making  in  the face of  uncertainties. This  capability coupled with a  newly  developed  optimizer  for the ASPEN  simulator, further  allows  for a  {  Stochastic  Optimization }  wherein  the expected or the  most likely value of an uncertain objective  function is optimized.  The Stochastic Modeling and the Stochastic Optimization capabilities will  be  presented  and discussed  in the context of the ASPEN simulator.", "speaker": "URMILA M. DIWEKAR", "tag": "Engineering", "file_name": "cmu.andrew.org.heinz-2833_0", "id": 2}, {"topic": "Environmental Talk in 2 hrs", "description": "The talk is on his perspective as a delegate to the UN RIO conference on the environment held this past summer", "speaker": "Bill Wescott", "tag": "General", "file_name": "cmu.andrew.org.heinz-2910_0", "id": 3}, {"topic": "Mary Jane Jacob Lecture", "description": "The last in the Art Department Fall Lecture Series, the speech is entitled 'After Monuments: A New Public Art for American Cities.'  If you care about the urban landscape, come listen!", "speaker": "Mary Jane", "tag": "Architecture", "file_name": "cmu.andrew.org.heinz-3047_0", "id": 4}, {"topic": "Fwd: tax seminars", "description": "A seminar on completing the 1040NR, the federal income tax form for non-residents. CMU Payroll Services will also talk about withholding procedures for non-residents. 1040NR forms and instructions are available at the Office of International Education, 219 Smith Hall. However, OIE cannot provide tax advise, so please be sure to attend the seminar.", "speaker": "Jim Boshears", "tag": "General", "file_name": "cmu.andrew.org.heinz-3528_0", "id": 5}, {"topic": "INI SPECIAL SEMINAR", "description": "In order for the telecommunications companies to successfully function in a new world, become more market focused and competitive, companies must be able to creatively construct relationships and interact with other companies as both competitors and partners. Regulators will have to transition their role from one of the monitoring the costing and pricing of carriers to monitoring competitive entry conditions, service quality, and administer programs to help those who might otherwise be left behind.", "speaker": "Andrew C. Barrett", "tag": "Business", "file_name": "cmu.andrew.org.heinz-3541_0", "id": 6}, {"topic": "Soup & Substance Lecture", "description": "Soup & Substance Series. The Future of the Clinton Presidency", "speaker": "Erik Devereux", "tag": "Politics", "file_name": "cmu.andrew.org.heinz-3573_0", "id": 7}, {"topic": "Fwd: Seminar:Politics of Pensions", "description": "Professor Orloff is known for her innovative work in the comparative history of welfare state development and the issue of gender in the formation of welfare policy.", "speaker": "Professor Ann Orloff", "tag": "History", "file_name": "cmu.andrew.org.heinz-5966_0", "id": 8}, {"topic": "2 talks on Gender and Academia", "description": "Discussion of the final report of the Commission on the Role and Status of Women at Carnegie Mellon University. Pat Laughlin, one of the co-chairs of the commission, will offer her perspective on the history and evolution of the commission, as well as its recommendations and implementation plan.", "speaker": "Pat Laughlin", "tag": "History", "file_name": "cmu.andrew.org.heinz-6208_1", "id": 9}, {"topic": "Technology and Urban Violence: Community Control and Community Empowerment", "description": "As some of you know, we have received one of the GTE Foundation grants for a series of lectures on 'Technology and Ethics'. The theme for which we submitted a proposal was 'Ethics of Technology as an Ethic of Care'.  It will consist of four lectures on four facets of this topic, one this spring, two in the fall, and one in Spring 1995.", "speaker": "Rosemary Chalk", "tag": "Engineering", "file_name": "cmu.andrew.org.heinz-6248_0", "id": 10}, {"topic": "Second talk: University of 21st Century", "description": " The topic is ~The Invisibility of Privilege:  The Intersection of Race and Gender. Speaker explore the assumptions and implications of privilege in institutions of higher education. Peggy McIntosh~s ~White  Privilege:  Unpacking the Invisible Knapsack,~ which was found in the  July/August 1989 issue of Peace and Freedom, serves as a basis of  discussion.  This series of brown bag seminars offers an opportunity for students and faculty at the two universities to meet and explore together the changes and challenges faced by the university of the future  Each seminar will be led by panelists from one or both of the sponsoring institutions and will use a published article as a stating-off point for discussion. Copies of the articles will be made available at the Reserve Desk of Hunt Library and at the Special Projects Office of the Associate Provost in Warner Hall 419.  The seven seminars will take place at noon and last approximately an hour;  participants will be invited to bring a lunch.  Beverages and dessert will be provided.  In order to know how much food to order, we would appreciate an RSVP to 8-7970 or kj26@andrew.", "speaker": "Carla Gary", "tag": "Education", "file_name": "cmu.andrew.org.heinz-7412_0", "id": 11}, {"topic": "Pitt-CMU Rationality Seminar", "description": "Al Roth and Ido Erev will speak on 'Low versus high game theory, part I: Boundedly rational adaptive behavior in the intermediate term'.", "speaker": "Al Roth", "tag": "Engineering", "file_name": "cmu.andrew.org.heinz-8113_0", "id": 12}, {"topic": "Tools for Inventing Organizations: Toward a Handbook of Organizational Processes", "description": " This talk will describe a new project at the MIT Center for Coordination Science that is intended to help with tasks such as business process reengineering, enterprise modeling, and enterprise integration  The project includes (1) collecting examples of how different organizations perform similar processes, and (2) representing these examples in an on-line 'process handbook' which includes the relative advantages of the alternatives.  The handbook is intended to help (a) redesign existing organizational processes, (b) invent new organizational processes that take advantage of information technology, and perhaps (c) automatically generate software to support organizational processes.  A key element of the work is a novel approach to representing processes at various levels of abstraction.  This approach uses ideas from computer science about inheritance and from coordination theory about managing dependencies.  Its primary advantage is that it allows users to explicitly represent the similarities (and differences) among related processes and to easily find or generate sensible alternatives for how a given process could be performed", "speaker": "Thomas W. Malone", "tag": "Engineering", "file_name": "cmu.andrew.org.heinz.dss-91_0", "id": 13}, {"topic": "Hirokazu Fukawa Lecture", "description": "The 1992-23 Art Department Lecture Series opens on Tuesday, Sept. 15 with Art Department visiting professor Hirokazu Fukawa. His performances, installations and sculpture are generated from inter-cultural experiences and often respond to his immediate environment. Fukawa has worked both alone and collaboratively , combining natural materials with man-made materials, ranging from dried fish to fluorescent light and wood.  Fukawa grew up in Japan where he received degrees in social science and graphic design. He has studied at the Banff Centre School of Fine Arts in Canada and received his Master of Fine Arts in sculpture from the Rhode Island School of Design in 1990. His work has been exhibited throughout North America and Japan, and he currently has an installation at the Pittsburgh Center for the Arts", "speaker": "Hirokazu Fukawa", "tag": "Arts and Music", "file_name": "cmu.andrew.org.heinz.mam-563_0", "id": 14}, {"topic": "Mary Jane Jacob Lecture", "description": "The Department of Art presents Mary Jane Jacob, Independent Curator from Chicago, tomorrow night, November 17th, at 5 PM in Doherty Hall, Room 2315. The last in the Art Department Fall Lecture Series, the speech is entitled 'After Monuments: A New Public Art for American Cities.' If you care about the urban landscape, come listen!", "speaker": "Mary Jane Jacob", "tag": "Arts and Music", "file_name": "cmu.andrew.org.heinz.mam-694_0", "id": 15}, {"topic": "Career Enhancement Seminar", "description": "CAREER ENHANCEMENT THROUGH SELF-ASSESSMENT & RESUME PREPARATION. The Office of Career & Student Services presents a seminar for MPM students: 'You Can't Get There From Here...Unless You Know Where You Are'. Please make reservations with Lou or Jean in career services by calling 268-2166 or....just pop in. A continental breakfast will be provided.", "speaker": "Kathy Bernard", "tag": "Career", "file_name": "cmu.andrew.org.heinz.mpm-61_0", "id": 16}, {"topic": "DECUS Presentation", "description": " The title of Mr. Hancock's presentation will be 'The Trouble with Ethernet'. It promises to be both a practical and humorous look at managing an Ethernet.  Bill Hancock, Vice President of Network-1, Inc., is an internationally respected consultant and engineer with many years of experience in network services to many of the Fortune 1000. An ANSI and ISO standards committee member and U.S. Network Expert, Mr. Hancock has worked on many international network standards and has authored numerous network articles and books on network technologies and standards. Mr. Hancock brings a unique first-hand insight to network management and troubleshooting techniques, protocol architecture and design, network design, client-server applications, performance and tool requirements.  Mr. Hancock is recognized in Who's Who in Science and Engineering and Who's Who in the Computer Industry. Mr. Hancock is also the recipient of the DECUS Technical Excellence Award, the top achievement award given by the U.S. Chapter.", "speaker": "Bill Hancock", "tag": "Engineering", "file_name": "cmu.andrew.org.heinz.mpm-84_0", "id": 17}, {"topic": "Upcoming seminar on medical management", "description": " The presentation will be: 'The Measurement and Improvement of Clinical Outcomes' Marc Irwin, Ph.D., Allegheny General Hospital  Dr. Irwin will discuss how AGH is responding to the increasing needs (and requirements) for measuring the outcomes of how care is provided.  In many ways, this area represents a new frontier for the health care industry as providers are being increasingly asked -- by health care payors -- to demonstrate the effective and efficiency of their services. Please mark this date and time on your calendars.  (This will be the last such seminar this semester.)", "speaker": "Marc Irwin, Ph.D.", "tag": "Science", "file_name": "cmu.andrew.org.heinz.mpm-384_0", "id": 18}, {"topic": "Fwd: SEMINAR: Rebuilding Cities", "description": "Members of the Heinz School community:  The first Professional Seminar of the 1994-95 year will take place next Tuesday, October 25, at 12: 30 pm in room 1001. The speaker is architect Stefani Ledewitz, who has emerged as a strong influence on community revitalization in Pittsburgh. Her seminar, 'Rebuilding a City From the Inside Out: Lessons for Policy from Pittsburgh's South Side,' will include a slide show presentation of specific projects and a discussion of how public-private partnerships can best facilitate a sensible and liveable revitalization of urban communities. I encourage you to attend this seminar and participate in the discussion of this important and timely topic. Please note that space will be limited because of the room.", "speaker": "Stefani Ledewitz", "tag": "Architecture", "file_name": "cmu.andrew.org.heinz.muni-61_0", "id": 19}, {"topic": "HCI Seminar/Wed. April 14, '93-Jolene Galegher, Dept. of English", "description": "In this presentation, I'll be describing a series of studies of communication patterns among people who are working together to produce complex intellectual products (e.g., scientific research articles) over long periods of time.  The studies focus on media choice and media effects, and on task distinctions that determine these outcomes.  They include both retrospective interviews about naturally occurring interactions and experiments in which we manipulated access to communications media in order to assess the effects of these variations on project outcomes such as time to completion and coordination difficulty. These investigations indicate that communication requirements are quite variable over the lifespan of projects, but that, across projects, one can observe regularities that have important implications for the design of technologies to support collaborative work. In particular, these studies reveal needs for different kinds of flexibility at different points in the project life cycle.  During the early stages of of work on open-ended projects and problems, equivocality is high, and achieving a shared sense of direction seems to require the flexibility in modes of expression that real-time face-to-face communication permits.  In later stages of project work, however, people often use a relay model of work on collaborative projects.  Thus, the interactivity and expressiveness that characterize face-to-face communication become less important; instead, people require tools that permit flexibility in social roles within the collaborative relationship.  The talk will conclude with a discussion of new research projects that attempt to go beyond either/or models of media effects by examining communication patterns within naturally occurring, media-rich environments", "speaker": "Arjun Makhijani", "tag": "Engineering", "id": 20, "file_name": "cmu.andrew.org.cmu-hci-328:0"}, {"topic": "HCI Seminar/Wed. April 7, '93/Alex Waibel", "description": "In this talk I will describe recent work aimed at developing more natural, inobtrusive, and robust user interfaces, by including *all* the modalities of human communication in the interpretation of human intent.  While multi-media information (images, text, sound) is now becoming available on the output side of most workstations and PC's, input is still mostly limited to keyboard and mouse.  Attempts at the use of alternate modalities have mostly focused on single input modalities and have so far found limited acceptance.  In an effort to improve this situation, we have recently begun to develop ways to process a multiplicity of signals that are believed to all carry meaning in human communication.  These include: Speech Understanding, Character Recognition, Lipreading, Eye-tracking, Gesture Recognition.  I will describe the signals and the methods we have developed to process them. I will then look at ways in which these can be combined to derive *joint* interpretations from multi-modal events.  Some modalities occur synchronously and can (should?) be combined at the signal or recognition level (e.g., lipreading and speech recognition), others are asynchronous (e.g., gesture and speech) and have to be combined at a semantic or pragmatic level.  I will discuss our preliminary results in combining lipreading with speech recognition, and gesture with speech recognition. In both cases the results suggest that more robust and natural interaction can be achieved by combination of modalities.  I will conclude by outlining our strategy to extend these preliminary results to practical user interfaces, such as editors and calendars", "speaker": "Alex Waibel", "tag": "Engineering", "id": 21, "file_name": "cmu.andrew.org.cmu-hci-326:0"}, {"topic": "HCI Seminar/Wed. Mar. 31, '93/John Gould- WeH 5409, 3:30", "description": "There is a trend, at least at IBM Research, to move toward creating complete, commercial computer applications ('solutions'), with less emphasis on creating enabling algorithms, tools, and technologies for others.  Where is the 'research beef' in this work, which has already gone on for decades by teams of people varying greatly in size and skill using a variety of tools, and having various degrees of success?  I believe this trend provides several opportunities for research which would otherwise go unfulfilled, and I will discuss these", "speaker": "JOHN GOULD", "tag": "Engineering", "id": 22, "file_name": "cmu.andrew.org.cmu-hci-323:0"}, {"topic": "HCI&G Seminar-Wed. Jan. 20,'93/Richard Young Speaker", "description": "Although modelling in HCI research has tended to focus upon the user, he or she is not the only entity of relevance to interface design.  Usability is a function not just of the user, but of the joint user-computer interactive system.  Thus it is not sensible to consider user modelling in isolation from the rest of interface design.  Furthermore, unless a way is found for user modelling techniques to be integrated with the rest of the design process, they are unlikely to be applied.  It is not credible that busy interface designers will take 'time off' from design proper to 'do some user modelling'.  In recognition of these considerations, a collaborative multi-disciplinary project called Amodeus is aimed at understanding how different kinds of modelling (of the user, of the computer system, and of design) can be brought together to support the design of usable interfaces.  The project draws on two Psychological approaches to user modelling, an approach from Computer Science for applying formal methods to interface design and a complementary approach from Software Engineering for refining formal specifications into software architectures, a technique for representing the design rationale of an interface, and a cross-disciplinary approach to the interaction in its own right.  To illustrate how a multi-disciplinary analysis might proceed, the talk will discuss a specific technical problem that arises during interface design, namely the specification of the Undo facility for a collaborative text-editor.  The end result of the analysis is an understanding, from multiple perspectives, of the design options, of their consequences and trade-offs, of their impact on usability, and of other facters influencing the appropriate choices for the design", "speaker": "Richard M Young", "tag": "Engineering", "id": 23, "file_name": "cmu.andrew.org.cmu-hci-303:0"}, {"topic": "HCI & G Seminar - Change in time for Emily Roth Talk", "description": "We have been studying  crew problem-solving and decision-making in simulated power plant emergencies with the objective of developing the next generation computerized control room.  Power plant control rooms offer some unique challenges to HCI. Because they are complex, high-risk worlds, there is a premium on understanding operator problem-solving and decision-making in complex emergencies and providing aids that will reduce the probability of a decision-making error.  This has led to an emphasis on cognitive task analysis    and the development of computerized alarm and display concepts intended to support diagnosis and response planning.  In current control rooms operators are required to follow highly prescriptive paper-based procedures verbatim.  Paper-procedures, like highly directive expert systems,  can be inefficient and brittle.  The goals of our work have been to understand the interplay between operator cognition and procedures in handling complex emergencies with    the aim of defining requirements for more adaptive decision-support systems.    In my talk I will try to describe some results of our studies on operator performance in simulated emergencies,  issues in advanced computerized control    room design, and some of the HCI challenges raised", "speaker": "Emilie Roth", "tag": "Engineering", "id": 24, "file_name": "cmu.andrew.org.cmu-hci-302:0"}, {"topic": "HCI & G Seminar/Wed. Jan. 13,'93-3:30-5:00pm-WeH 5409", "description": "We have been studying  crew problem-solving and decision-making in simulated  power plant emergencies with the objective of developing the next generation  computerized control room.  Power plant control rooms offer some unique  challenges to HCI. Because they are complex, high-risk worlds, there is a  premium on understanding operator problem-solving and decision-making in  complex emergencies and providing aids that will reduce the probability of a  decision-making error.  This has led to an emphasis on cognitive task analysis and the development of computerized alarm and display concepts intended to  support diagnosis and response planning.  In current control rooms operators  are required to follow highly prescriptive paper-based procedures verbatim.   Paper-procedures, like highly directive expert systems,  can be inefficient  and brittle.  The goals of our work have been to understand the interplay  between operator cognition and procedures in handling complex emergencies with the aim of defining requirements for more adaptive decision-support systems.  In my talk I will try to describe some results of our studies on operator  performance in simulated emergencies,  issues in advanced computerized control room design, and some of the HCI challenges raised", "speaker": "Emilie Roth", "tag": "Engineering", "id": 25, "file_name": "cmu.andrew.org.cmu-hci-301:0"}, {"topic": "HCI & G Seminar/Alex Rudnicky/Wed. Oct. 21, '92", "description": "Multi-modal systems allow users to both tailor their input style to the task at hand and to use input strategies that combine several modes in a single transaction.  As yet no consistent body of knowledge is available for predicting user behavior in multi-modal environments or to guide the design of multi-modal systems.  This is particularly true when interfaces incorporate new technologies such as speech recognition.  For activities in a workstation environment, formal comparisons of speech with other input modes have failed to demonstrate a clear advantage for speech on conventional aggregate measures of performance such as time-to-completion, despite a consistent advantage displayed by speech at the level of single input operations.  The difference can actually be attributed to the additional incurred costs of non-real-time recognition and error correction.   While real-time performance can be achieved, it is unlikely that error-free recognition will be available in the near future.  Given these shortcomings, we might ask if speech can provide advantages to the user along dimensions other than task speed, for example by reducing the effort needed to generate an input.  The talk will describe some recent experiments that assess user behavior in a multi-modal environment in which actions can be performed with equivalent effect in speech, keyboard or scroller modes.  Results indicate that users freely choose speech over other modalities, even when it is less efficient in objective terms, such as time-to-completion or input error", "speaker": "Alexander I. Rudnicky", "tag": "Engineering", "id": 26, "file_name": "cmu.andrew.org.cmu-hci-274:0"}, {"topic": "HCI Reading Seminar", "description": "This reading seminar will meet for 1.25 hours each week to discuss current  issues in human-computer interaction (HCI).  The first few meetings will comprise an introduction to issues in HCI and in HCI system measurement & evaluation .   Each meeting thereafter will focus on a particular issue, its possible solutions, and evaluation approaches for the expected results .   Readings will be made available a week before each meeting (except the first  one).  It is expected that there will be about two readings per week - not a  big burden .   Anyone is welcome to participate .   People who have HCI or methodological problems to share with the group are welcome, too . TOPICS:  -------  0.  Organizational meeting .  1.  Introduction to HCI issues, problems and evaluation methods .  2.  System usability and evaluation .  3.  Comparison of four methods of user interface evaluation .  4.  The use of color in HCI .  5.  Computer interfaces for people with physical and cognitive disabilities .   Topics after this point will be determined by the interests of the group.   Likely candidates are :  Help systems  HCI theory  Task analysis and process tracing  Speech interfaces  Expertise and skill acquisition", "speaker": "Maxion", "tag": "Engineering", "id": 27, "file_name": "cmu.andrew.org.cmu-hci-271:0"}, {"topic": "Joy Mountford Presentation", "description": "Joy Mountford, Manager of Human Factors for the Advanced Technology Group at Apple Computer Inc, will give a presentation tomorrow, Thursday, 17 Oct. It will be held in the Multi-purpose Room, in the basement of Hunt Library, from 10 to 11:30am.  The title of her presentation is 'Interface Directions for Using Multi-media.' Here's a portion of her abstract: 'Future electronic communications will involve combining data of different media types across different places and times. Working examples of future interface metaphors that enable navigating multi-media data bases will be demonstrated. This presentation will show some techniques for designing and iterating interfaces to new types of data bases, as well as show some examples of new interface metaphors.' This is late notice, I realize, but I hope some of you can make it!  Dan Boyarski Design Department", "speaker": "Joy Mountford", "tag": "Engineering", "id": 28, "file_name": "cmu.andrew.org.cmu-hci-190:0"}, {"topic": "Integrated Network for the Teaching of Students in Informatics", "description": "From 1988 to 1990, a pilot project was carried out aimed at establishing the necessary preconditions for a network allowing    (undergraduate) students to do much of their work at home with their    homebased workstations fully integrated .  The project had first to deal    with the technical problems of network integration ({it cf.} ATHENA    project), but its main purpose was to find answers to such questions as :   --  How will supervision by teaching assistants of exercises and tests be influenced ? --   Will the greater flexibility in student work times and access to central computing allow faster learning ? --   What effects are there to spending more time studying at home ? --   How will communication with and among students change ?  The project had an extensive evaluation through a series of    questionnaires .   Two groups of students were formed, one in which    every individual had a workstation at home, and one in which every    student had only access to the terminals in the computer clusters at    the University .   These groups were compared, and the two classes of    1988/90 and 1989/90 were observed independently .   Anonymity was    guaranteed through the cooperation with the data security office of    the University .   The talk will outline the setting of the project and    report on its results", "speaker": "Professor Manfred Paul", "tag": "Teaching", "id": 29, "file_name": "cmu.andrew.org.cmu-hci-174:0"}, {"topic": "Discount Usability Engineering", "description": "Usability engineering is the discipline of improving the usability of user interfaces in a situation of resource constraints. Many methods for usability engineering exist and are available for use if people want to use them.  Unfortunately, the available evidence shows that many companies do not use even basic usability engineering techniques, partly because they are discouraged by the perceived complexity of those methods.  The 'discount usability engineering' method is intended for people who want to get most of the benefits from usability engineering without the expense and complexity of the methods needed to achieve perfect results. It consists of scenarios, simplified thinking aloud, and heuristic evaluation. Our findings indicate that even cheap thinking aloud studies can find a large proportion of the usability problems in an interface and that heuristic evaluation can also find many usability problems when a small number of evaluations are aggregated", "speaker": "Jakob Nielsen", "tag": "Engineering", "id": 30, "file_name": "cmu.andrew.org.cmu-hci-87:0"}, {"topic": "UI talk  **TODAY**", "description": "AUTOMATIC EVALUATION OF USER INTERFACES", "speaker": "Dan R. Olsen Jr.", "tag": "Engineering", "id": 31, "file_name": "cmu.andrew.org.cmu-hci-8:0"}, {"topic": "PS Seminar 11/30/87", "description": "AUTOMATIC EVALUATION OF USER INTERFACES. A  major  question that one must ask of any user interface is 'How good is it'.  Most approaches to answering  this  question are  either very subjective or are so labor intensive as to not be applicable on a wide scale.  An  approach  to  automatically evaluating  the  quality  of  user  interfaces  to  interactive graphics applications will be the topic of  this  presentation. This  approach  is  based  on  the technology of User Interface Management Systems (UIMS).  One of the properties of a UIMS  is that  the  description  of  the interactive dialog is separated from the application code.  Because this description  has  been factored  out  of  the  code,  it  is  possible to analyze this description to answer  qualitative  questions  about  the  user interface.    In  particular  it  is  possible  for the UIMS to monitor  all  user  activity  and  map  such  activity  to  the particular   components  of  the  interface  description  which control this activity.  User interface  problems  can  then  be automatically  identified  in  a  way which focuses the work of human factors experts on the most cricital problems first", "speaker": "Dan R. Olsen Jr.", "tag": "Engineering", "id": 32, "file_name": "cmu.andrew.org.cmu-hci-7:0"}, {"topic": "Education Seminar Series", "description": "'Evaluating Engineering Education:  A Stakeholder-Driven, Outcomes-Based Approach'  Accreditation, the only evaluative technique consistently used in most engineering schools today, provides a measure of the resources the institution has to offer and the educational procedures it follows, but it does not provide any real measure of the educational outcomes of the engineering programs.  This paper proposes a flexible, quantitative methodology for setting evaluation criteria which can be used to determine how well engineering institutions prepare their graduates for the working world. Survey, decision-analytic and concordancee analytic techniques are combined to develop a set of ~politically optimal,~ weighted educational outcomes, indicating a specified industry~s needs regarding the qualifications of their entry-level engineers.  The proposed methodology is illustrated through the development of educational evaluation criteria based on the needs of the international construction industry.", "speaker": "Larisa Naples", "tag": "Education", "id": 33, "file_name": "cmu.andrew.org.cil-49:0"}, {"topic": "Quis Metabitur Ipsos Mensores?", "description": "The human race continues to limp along on such a paltry understanding of how people become educated that it is unclear whether we've made any progress over ancient Greek pedagogues.  The CIL has leveled itself at improving this astonishing oversight in scientific priorities, and  now contemplates a variety of projects which may give a more principled  basis for program design.  But there has never been any shortage of ideas on how to educate; the crucial shortfall lies in cleanly designed  experiments that distinguish clearly defined hypotheses.  This talk points out issues and strategies in the evaluation of competing  theories of learning", "speaker": "David Banks", "tag": "Education", "id": 34, "file_name": "cmu.andrew.org.cil-28:0"}, {"topic": "CIL Member to Lecture at Physics Colloquium", "description": "Students encounter many difficulties in electricity and magnetism.  Ruth Chabay and I have attacked these problems by developing a new course and a new textbook (recently published by Wiley) in which we emphasize qualitative reasoning as strongly as quantitative reasoning, thereby providing a conceptual framework within which the quantitative manipulations make more sense.  The course places heavy emphasis on atomic-level description and analysis, with detailed attention to the atomic structure of matter and its electric and magnetic interactions, with special emphasis on polarization phenomena in metals, insulators, and ionic solutions.  Each student has an inexpensive experiment kit which lets them perform crucial experiments during lecture, recitation, or at home, and which permits tight integration of theory and (just-in-time) experiments.  Electrostatics and circuits are usually portrayed as completely separate sciences, but we unify them by analyzing circuits directly in terms of the fundamental Coulomb interaction", "speaker": "Bruce Sherwood", "tag": "Education", "id": 35, "file_name": "cmu.andrew.org.cil-22:0"}, {"topic": "Education Seminar Series", "description": "This talk will explore how people read instructional texts about using technology. It will illustrate the difficulties readers experience, showing why readers' problems are often a function of the complexity of the task posed by the design of the technology and the design of the documents", "speaker": "Karen Schriver", "tag": "Education", "id": 36, "file_name": "cmu.andrew.org.cil-5:0"}, {"topic": "Three Ways to Gum up a Statistics Course", "description": "My talk will be in two parts. In the first part, I shall offer some general comments and observations on the state of undergraduate statistics education in the US -- some trends, some obstacles to reform, and some hopeful signs. Among the trends and hopeful signs is this one: increasing numbers of statistics teachers use hands-on activities to generate data and teach statistical ideas. In the second part my talk I shall describe three sets of activities that I developed last year in an elementary linear models course. All three use inexpensive, everyday equipment, are quick and simple to set up, and can be adapted for use in teaching over a range of educational levels, from kindergarten to graduate statistics courses", "speaker": "George W. Cobb", "tag": "Education", "id": 37, "file_name": "cmu.andrew.org.cil-2:0"}, {"topic": "Fwd: CS/PSC Seminar 11/11", "description": "The goal of the LAPACK and ScaLAPACK projects is to produce very fast, very reliable software to solve standard problems of numerical linear algebra, including solving linear systems of equations, solving least squares problems, and finding eigenvalues. The October 94 LAPACK release (about 800K lines in Fortran, 1M lines in C) runs on uniprocessors and shared memory parallel computers, and ScaLAPACK (next release November 94) runs on distributed memory computers. We describe the design issues involved in attaining high speed and portability at the same time, as well as new algorithms and open problems. We also discuss the role of this work in ongoing work at Berkeley in building a unified parallel programming environment, called Castle", "speaker": "George W. Cobb", "tag": "Engineering", "id": 38, "file_name": "cmu.andrew.org.che.chegsa-597:0"}, {"topic": "Lecture Demonstration by Ravi Kiran", "description": "Society for the Promotion of Indian Classical Music and Culture Amongst Youth (Carnegie Mellon University Chapter)presents Lecture Demonstration by R A V I   K I R A N ( On the Chitra Veena / Gottuvadyam ) accompanied by KUMBAKONAM GANESH ( On the Mridangam )", "speaker": "Ravi Kiran", "tag": "Arts and Music", "id": 39, "file_name": "cmu.andrew.org.che.chegsa-242:0"}, {"topic": "Women's Speaker Series", "description": "The topic is: Thriving in the Academy: A Welcome Back Reception Honoring Graduate Women", "speaker": "Kathleen Minadeo Johnson", "tag": "Education", "id": 40, "file_name": "cmu.andrew.org.che.chegsa-224:0"}, {"topic": "Talk", "description": "I will be giving a talk on: 'Phase and Dynamic Behavior of Micelles: A Review of Fundamentals and Applications' The first half of the talk will be in developing a definition of microemulsions based on simple macroscopic thermodynamic considerations of the phase behavior of the bulk fluids, which helps eliminate some ambiguity found in 'swollen micelle' or 'stable emulsion' descriptions.  I will also discuss several factors that can help determine the structure of the microemulsion phase. The second half will be a qualitative discussion of some of the various techniques available for investigating physical properties of micelles.  It will include the use of flourescent probes, differntial scanning calorimetry and a comparison of light, x-ray and neutron scattering methods.  Also, our current investigations using flourescence and DSC will be presented", "speaker": "Bob Auger", "tag": "Science", "id": 41, "file_name": "cmu.andrew.org.che.chegsa-58:0"}, {"topic": "Art Dept Lecture Series Continues", "description": "The CFA Art Department continues its lecture series with a talk from Steven Kurtz.  Mr. Kurtz is a new genre artist and a founding member of the art and theory collective Critical Art Ensemble", "speaker": "Steven Kurtz", "tag": "Arts and Music", "id": 42, "file_name": "cmu.andrew.org.cfa.cfa-today-557:0"}, {"topic": "Art Department Lecture Series", "description": "Art Department Lecture Series Continues with Baltimore Artist Joyce Scott Joyce Scott has studied traditional Navajo rug weaving, traditional and contemporary Japanese theatre techniques, and traditional Native American beadwork. Her work centers around political and social issues, particularly issues of race and gender. Small sculptures of beads and thread, which at first look toy-like, are actually social commentaries about the psychological and physical dangers of being an African-American and a woman in our society", "speaker": "Joyce Scott", "tag": "Arts and Music", "id": 43, "file_name": "cmu.andrew.org.cfa.cfa-today-533:0"}, {"topic": "1994 Art Lecture Series", "description": "The Department of Art presents the Ninth Lecture in The Robert Lepper Distinguished Lecture Series in Creative Inquiry AN EVENING WITH MERCE CUNNINGHAM November 29 Joyce Scott Artist, Baltimore", "speaker": "MERCE CUNNINGHAM", "tag": "Arts and Music", "id": 44, "file_name": "cmu.andrew.org.cfa.cfa-today-516:1"}, {"topic": "Art Lecture: 10/13/92", "description": "The Art Department Lecture Series continues tomorrow evening at 5 pm with multi-media artist, Woody Vasulka. His lecture is entitled 'The Theater of Hybrid Automata.' A co-founder of The Kitchen, a New York media theater, Vasulka has participated in major video shows in the US and abroad", "speaker": "Woody Vasulka", "tag": "Arts and Music", "id": 45, "file_name": "cmu.andrew.org.cfa.cfa-today-212:0"}, {"topic": "Architecture Lectures", "description": "There is quit a bit happening in the Department of Architecture . Here is a list of upcoming lectures sponsored by the department", "speaker": "Ermolinsky", "tag": "Architecture", "id": 46, "file_name": "cmu.andrew.org.cfa.cfa-today-19:0"}, {"topic": "Speaker", "description": "As part of our speakers series, , Assistant Professor of History and Women's Studies, Ohio State University, will visit Carnegie Mellon University on April 22-24 is the author of the fortcoming book, 'What a woman ought to be and to do': Black Professional Women during the Jim Crow Era (in-press, University of Chicago Press) On Saturday morning, an informal breakfast meeting is scheduled for will discuss trends in research and teaching of American and African American women's history The place of these meetings will be announced in a forthcoming flyer Her study is based upon a large body of manuscript materials as well as oral interviews She examines the lives of over 40 black professional women, including school teachers, nurses, social workers, and librarians She is also breaking ground on a new study of slave women, where she proposes to study 'mothering' as a 'contested terrain,' which neither slaveholders nor slaves fully controlled", "speaker": "Stephanie Shaw", "tag": "History", "id": 47, "file_name": "cmu.andrew.org.ACE-NIP-9:1"}, {"topic": "Psychology Post-Doc Talk", "description": "Phonological and semantic priming was explored in children using a cross-modal picture-word interference paradigmPictures of familiar objects (e.g., snake, moon, hand) were presented to 5- to 11-year-olds and adults on a computer screen while digitized auditory stimuli (words and non-words) were presented simultaneously over head-phonesThe auditory stimuli were related (phonologically or semantically) or unrelated to the names of the picturesChildren were instructed to name the pictures as quickly as possible while ignoring the auditorily presented itemsChildren were tested over multiple sessions to vary the stimulus onset asyncrony (SOA--the interval between presentation of the prime and presentation of the picture-to-be-namedRobust phonological priming occurred which was influenced by the lexical status of the prime (whether it was a non-word or a real word) and by whether the prime shared the onset consonant or rhymed with the name of the target pictureIn contrast, semantically-related auditory stimuli did not facilitate children's picture naming", "speaker": "Patricia Brooks", "tag": "Science", "id": 48, "file_name": "cmu.andrew.official.cmu-news-2811:0"}, {"topic": "Psychology Colloquium", "description": "The key challenge in the study of language ontogeny is to discover when and how language acquisition begins Most all prevailing theories about very early language ontogeny are based on the hypothesis that the infant's emerging linguistic abilities are neurologically determined by the mechanisms underlying the production and perception of sound and speech Indeed, the assumption that the neonate brain is neurologically set for the production and perception of sound and speech is tantamount to an axiom in studies of very early human language acquisition . I compare and contrast spoken and signed language acquisition, as signed languages have evolved in the absence of sound and utilize different neural substrates from those involved in the perception and production of speech In my talk, I will first summarize key findings that have resulted from over a decade of research in my laboratory concerning the maturational timing and structural content of very early language milestones I will then summarize the results of new studies using rare populations of children, including hearing children exposed to signed and spoken languages from birth and hearing children exposed exclusively to signed languages from birth with no systematic exposure to spoken languages whatsoever Based on surprising similarities in the timing and structural content of all children, be they acquiring spoken and/or signed languages, I will then advance a testable theory about the brain-based mechanisms and environmental factors that together make early human language acquisition possible I will argue for the existence of a pattern-recognition mechanism in newborns, specifically, a neural substrate, which is uniquely sensitive to specific distributional patterns in the input relevant to aspects of natural language temporal patterning I will further discuss how this mechanism crucially works in conjunction with general motor production and perceptual constraints in early language ontogeny I will also advance the hypothesis that sound or speech is not the critical input component in early language ontogeny; instead, the presence of specific patterns encoded within a given input modality is key I will suggest that the presence of particular patterns in the input (regardless of the modality), in addition to the brain-based sensitivity to perceive and attend to them, together permit very early language acquisition to begin", "speaker": "Laura Petitto", "tag": "Science", "id": 49, "file_name": "cmu.andrew.official.cmu-news-2752:0"}, {"topic": "Chem. Eng. Seminar", "description": "The Chemical Engineering Department will offer a seminar entitled 'Creating Value in the Chemical Industry,' at 10:45 a.m ., Tuesday, May 2 in Doherty Hall 1112 The seminar will be given by Dr. R. J. (Bob) Pangborn , Director, Central Research and Development, The Dow Chemical Company", "speaker": "Dr. R. J. (Bob) Pangborn", "tag": "Engineering", "id": 50, "file_name": "cmu.andrew.official.cmu-news-2737:0"}, {"topic": "CEDA Spring Lecture", "description": "The CEDA Spring Lecture Series presents 'Circuit-Level CAD for Microelectromechanical Systems,'", "speaker": "Gary K. Fedder", "tag": "Engineering", "id": 51, "file_name": "cmu.andrew.official.cmu-news-2680:0"}, {"topic": "Graduate Student Seminar Lunch", "description": "The last Graduate Student Seminar Series lunch will be held on Thursday, April 13 from noon - 1:30 p.m. in romm 207, Student Activities Center . Professor Sara Kiesler of SDS will speak on Carving A Successful Research Niche", "speaker": "Sara Kiesler", "tag": "Education", "id": 52, "file_name": "cmu.andrew.official.cmu-news-2674:0"}, {"topic": "Picosecond Motion in Proteins: Experiments, Analysis, Mathematical Simulation, and Interpretations", "description": "Departments of Biological Sciences and Chemistry, CMU", "speaker": "Dr. Franklyn G. Prendergast", "tag": "Science", "id": 53, "file_name": "cmu.andrew.official.cmu-news-2627:0"}, {"topic": "ECE Seminar", "description": "COMPUTERIZED TESTING AND SIMULATION OF CONCRETE CONSTRUCTION", "speaker": "FARRO F. RADJY, PH.D.", "tag": "Engineering", "id": 54, "file_name": "cmu.andrew.official.cmu-news-2611:0"}, {"topic": "Cultural Analysis Lecture", "description": "The Center for Cultural Analysis will host a lecture by Richard Maddox entitled 'The Best of Possible Islands: Seville, Expo '92, and the Politics of Culture in the New Spain'", "speaker": "Richard Maddox", "tag": "Arts and Music", "id": 55, "file_name": "cmu.andrew.official.cmu-news-2527:0"}, {"topic": "Physics Colloquium,Feb. 27", "description": "Physic Colloquium, Monday, Feb. 27, Steve Granick, University of Illinois, Urbana, 'Soft matter in a tight spot:  nano-rheology of polymers and complex fluids'", "speaker": "Steve Granick", "tag": "Science", "id": 56, "file_name": "cmu.andrew.official.cmu-news-2516:0"}, {"topic": "ChemE,Physics Seminar", "description": "The Chemical Engineering and Physics departments will host a seminar entitled 'Soft Matter in a Tight Spot: Nanorheology of Polymers & Complex Fluids,' at 4:30 p.m ., Monday, Feb. 27, in Wean Hall 7500 . The seminar will be given by Professor Steven Granick from the Materials Science Department at University of Illinois, Urbana-Champaign", "speaker": "Steve Granick", "tag": "Engineering", "id": 57, "file_name": "cmu.andrew.official.cmu-news-2513:0"}, {"topic": "Chemical Engineering Seminar", "description": "A seminar, entitled 'Graft Modification of Polymers in Twin Screw Extruders,' will be given at ., Tuesday, Feb. 21, in Doherty Hall 1112 . Professor Warren Baker from the Department of Chemistry at Queen's University, Kingston, Canada, will conduct the seminar", "speaker": "Warren Baker", "tag": "Engineering", "id": 58, "file_name": "cmu.andrew.official.cmu-news-2477:0"}, {"topic": "CIL Education Seminar", "description": "CENTER FOR INNOVATION IN LEARNING (CIL) EDUCATION SEMINAR SERIES 'Using a Cognitive Architecture to Design Instructions'. In my talk, I will describe how a cognitive model was used as a simulated student to help design instructions for training circuit board assemblers. The model was built in the Soar cognitive architecture, and was initially endowed with only minimal prerequisite knowledge of the task, and an ability to learn instructions. Lessons for teaching expert assembly skills were developed by iteratively drafting and testing instructions on the simulated student", "speaker": "Joe Mertz", "tag": "Education", "id": 59, "file_name": "cmu.andrew.official.cmu-news-2457:0"}, {"topic": "CEDA Spring Lecture Series", "description": "The Center for Electronic Design Automation, CEDA, in the department of Electrical and Computer Engineering will offer its first lecture in its Spring lecture series on 'The State of the Center for Electronic Design Automation'. Funded in part by the Semiconductor Research Corporation, SEMATECH, NSF, and by U.S. and international semiconductor companies, CEDA involves 12 faculty and 60 graduate students working on software tools to design, verify and fabricate next-generation integrated circuits and systems", "speaker": "Rob A. Rutenbar", "tag": "Engineering", "id": 60, "file_name": "cmu.andrew.official.cmu-news-2450:0"}, {"topic": "Marketability Talk", "description": "Shelley Brozenick from Alumni Relations and Karen Litzinger from the Career Center would like to announce the third alumni career talk in a series of four . 'Strategies to Gain Experience and Increase Marketability' The Student Alumni Relations Council (SARC) invites you to a Career Talk featuring Andrew Gault , HS'80, HNZ'94 and three university speakers Mary Francis McLaughlin (volunteer and community service opportunities), Jessie Ramey (research opportunities), and Judi Mancuso (part-time, work-study, summer and internship opportunities) on Tuesday, January 31 at 7:00 P.M . in the  Carnegie Conference Room, 1st Floor Warner Hall  . Call #8-8451 on or before Monday, January 30 to reserve a seat", "speaker": "Andrew Gault", "tag": "Career", "id": 61, "file_name": "cmu.andrew.official.career-center-1495:0"}, {"topic": "MHC Class II: A Target for Specific Immunomodulation of the Immune Response", "description": "Departments of Biological Sciences Carnegie Mellon and University of Pittsburgh. MHC Class II: A Target for Specific Immunomodulation of the Immune Response", "speaker": "Dr. Jeffrey D. Hermes", "tag": "Science", "id": 62, "file_name": "cmu.andrew.academic.bio-242:0"}, {"Topic:": "Seminar Series on Rational Choice", "description": "This interdisciplinary series is sponsored by the Dean of Arts and Sciences and co-organized by the Departments of Economics, Philosophy, Political Sciences, and Sociology, the Institute of Statistics and Decision Sciences, the Institute of Public Policy, and the Fuqua School of Business", "speaker": "Teddy Seidenfeld", "tag": "Business", "id": 63, "file_name": "cmu.andrew.org.heinz.phd-523_0"}, {"topic": "Ph.D. Presentations", "description": "The Ph.D. presentations this week are: Algorithmic Approaches to Confidentiality:  Disclosure Detection and Protection for Multivariate Categorical Databases", "speaker": "Sumit Dutta Chowdhury", "tag": "Ph.D. Presentations", "id": 64, "file_name": "cmu.andrew.org.heinz.phd-545_0"}, {"topic": "Ph.D. Presentations", "description": "The Ph.D. presentations this week are: The Role of Ability, Social Similarity and Social Networks on the Determination of Autonomous Work Groups", "speaker": "George Tita", "tag": "Ph.D. Presentations", "id": 65, "file_name": "cmu.andrew.org.heinz.phd-545_1"}, {"topic": "Ph.D. Presentations", "description": "The Ph.D. presentations this week are: Estimates of Effective Guarantees and Tax Rates in the AFDC Program for the Post-OBRA Period", "speaker": "Terra McKinnish", "tag": "Ph.D. Presentations", "id": 66, "file_name": "cmu.andrew.org.heinz.phd-545_2"}, {"topic": "Ph.D. Presentations", "description": "The Ph.D. presentations this week are: Alternative Approaches to Estimating the Efficiency", "speaker": "Cindy Bryce", "tag": "Ph.D. Presentations", "id": 67, "file_name": "cmu.andrew.org.heinz.phd-573_1"}, {"topic": "Public Lecture", "description": "The Popular Culture of Public Discourse and the Composition Classroom", "speaker": "Charles Paine", "tag": "Public Lecture", "id": 68, "file_name": "cmu.andrew.org.hss.eng-8_0"}, {"topic": "AN ARCHITECTURAL DESIGN OF A TOOLKIT FOR SYNCHRONOUS GROUPWARE APPLICATIONS", "description": "The central question studied in this Masters thesis is how to design high-level reusable components for developing synchronous groupware applications. A modern user interface requires the separation of applications into two components, namely application and graphical user interface. An effective architecture for synchronous, multiple-user groupware applications requires a separation of one more component from the application: the management of the session and shared data. This component provides a framework that manages the  collaborative user session, shared data in an abstraction form, and floor control. This thesis terms this separation coordination independence. This thesis demonstrates a feasibility of the architecture by describing an experimental system, called TALISMAN, using Garnet. TALISMAN is implemented as a single-process, centralized system with multiple remote graphical displays. The system which features this separation relies upon object inheritance and the constraint satisfaction mechanism in the underlying object system. The architecture also makes the conversion of a single-user application into a multiple-user application relatively easy. The oral report will include a video demonstration of sample applications", "speaker": "Nobuhisa Yoda", "tag": "Engineering", "id": 69, "file_name": "cmu.andrew.org.ini.ati-466_0"}, {"topic": "Current State of the ATM Products and Market", "description": "Recently, there has been a surge of interests in the area of high-speed networks. Information Superhighway promises to provide various digital services ranging from conventional telephone to interactive high-definition TV. Regional telephone companies and cable companies plan to invest billions of dollars to provide an infrastructure for high-speed networks. Multiplexing video with data, audio, voice, and text, for example, represents a disparity of data rates and qualities that poses new challenges when creating a technology that is faster, less expensive, and more flexible. Asynchronous Transfer Mode (ATM) is the internationally standardized transport technique for such high-speed multimedia networks. ATM is a promising technique for implementing an integrated access and transport network that can easily be shared by end-users holding multimedia service calls. My presentation will primarily be on the current state of the ATM technology, products, and market. It will include a discussion on the emerging network architectures in Broadband/ATM networking and some of the early applications. Additionally, the presentation will focus on some of the key issues related to interworking between ATM and other technologies and the drivers behind ATM adoption/deployment", "speaker": "M. Irfan Ali", "tag": "Engineering", "id": 70, "file_name": "cmu.andrew.org.ini.ms-2431_0"}, {"topic": "EPP Seminar Announcement", "description": "I present a series of studies (done in collaboration with George Loewenstein) into the effects of framing, or perspective taking, on decision processes. There is a curious anomaly in how much variety people prefer to consume. If people SIMULTANEOUSLY choose several items for the future they will typically choose more variety than if they make their choices SEQUENTIALLY. For example, if you go to the same restaurant for lunch every day, you may choose the same meal every time (this is sequential choice). On the other hand, if you had to reserve several lunches in advance, you will likely choose different dishes (simultaneous choice). Most intriguingly, people who PREDICT what they will want expect they will prefer less variety than do people who actually CHOOSE in advance. Here are three ways in which how one thinks of the identical consumption problem influences what one consumes. This effect is surprisingly robust in the face of a wide range of manipulations, many of which are described in my talk. I suggest that it is neither the separation in time between choice occasions, or the gap between choice and consumption that determines the degree of variety seeking, but whether several choices are framed as a series of single-item choices or as the choice of a set of items. I will discuss the implications of these findings in domains outside of consumer decision making", "speaker": "Dr. Daniel Reed", "tag": "Public Lecture", "id": 71, "file_name": "cmu.andrew.org.sds-26_0"}, {"topic": "Pubwash Lecture", "description": "Student Pugwash will present a lecture by of Grad School of Public Health of Pitt on The Prevalence of Lens Changes in Children Exposed to Radiation from the Chernobyl Accident", "speaker": "Richard Day", "tag": "Public Lecture", "id": 72, "file_name": "cmu.andrew.org.sds.pol_sci-49_0"}, {"topic": "", "description": "An environmental activist from Poland will be giving a talk on the environmental situation in Poland. She is involved in organizing environmental groups and will talk about that as well", "speaker": "Katarzyna Klich", "tag": "Science", "id": 73, "file_name": "cmu.andrew.org.sds.pol_sci-225_0"}, {"topic": "Career Talk", "description": "Inventing a Career out of a Liberal Arts Degree. They will discuss the following *understanding your options *the value of your degree *how to market it *how to find/research employers", "speaker": "Noelle C. Conover", "tag": "Career", "id": 74, "file_name": "cmu.andrew.org.sds.pol_sci-226_0"}, {"topic": "", "description": "Commercial Development Association of Pittsburgh meeting. Director of Communications for Adam Filippo & Associates, who will discuss Communicating the New Product Message", "speaker": "Karen Levine", "tag": "Business", "id": 75, "file_name": "cmu.andrew.org.stc-12_0"}, {"topic": "Seminars", "description": "Sonic Hedgehog and the Establishment of Embryonic Pattern", "speaker": "Dr. Clifford J. Tabin", "tag": "Science", "id": 76, "file_name": "cmu.andrew.org.stc-13_2"}, {"topic": "WEEKLY SEMINARS", "description": "DEPT. OF MOLECULAR GENETICS AND BIOCHEMISTRY - PITT - Studies of HSV Latency and Transgene Expression in the Nervous System", "speaker": "Dr. David J. Fink", "tag": "Science", "id": 77, "file_name": "cmu.andrew.org.stc-18_3"}, {"topic": "Weekly Seminars", "description": "PATHOLOGY SEMINAR SERIES - Diagnostic immunocytochemistry:  a 25-year perspective", "speaker": "Ricardo Mesa-Tejada", "tag": "Science", "id": 78, "file_name": "cmu.andrew.org.stc-23_1"}, {"topic": "CMU/Pitt Physics Seminars", "description": "Quark Model Description of the N-N System", "speaker": "Dr. Werner Koepf", "tag": "Science", "id": 79, "file_name": "cmu.andrew.org.stc-24_1"}, {"topic": "Special High Energy Seminar ", "description": "Production of Charm Mesons at High Transverse Momentum in 515 GeV/c {piminus} Nucelon Collisions", "speaker": "Steve Blusk", "tag": "Science", "id": 80, "file_name": "cmu.andrew.org.stc-29_0"}, {"topic": "Talk", "description": "an African American Jewish freelance writer in New York City provides viewpoints on: * relations between African Americans and Jews * making links between student organizations * her personal experience with the Nation of Islam", "speaker": "Jeannine Amber", "tag": "General", "id": 81, "file_name": "cmu.andrew.org.student-affairs.diversity.announce-2_0"}, {"topic": "HOW STUDENTS LEARN, HOW TEACHERS TEACH, AND WHAT USUALLY GOES WRONG WITH THE PROCESS", "description": "Students learn in a variety of ways:  by seeing and hearing, working alone and in groups, reasoning logically and intuitively, memorizing and visualizing and modeling. Teaching methods also vary:  some instructors lecture, others demonstrate or discuss, some focus on principles and others on applications; some emphasize memory and others understanding. How much students learn in a class depends on the match between their preferred learning styles and the insturctor's preferred teaching style. When there are serious mismatches, students do poorly and et discouraged, instructors get frustrated by low class performance and poor evaluations, and society may lose some potentially excellent professionals. Three questions are explored in this presentation</sentence>:  (1) Which aspects of learning style are particularly significant in higher education? (2) Which learning styles are preferred by most students and which are favored by the teaching styles of most professors?  (3 What can be done to reach students with a wider variety of learning styles than are now being reached with standard instructional methods?", "speaker": "Richard M. Felder", "tag": "Teaching", "id": 82, "file_name": "cmu.andrew.org.utc.teaching-24_0"}, {"topic": "seminars for grad students", "description": "Recently in some recitations TAs are being asked to incorporate group learning and problem solving into their teaching. Supervising students working in groups during class require specific skills to form productive groups:  ways to keep students focused on work rather than socializing,  ways to get them to cooperate rather than compete, show off or withdraw into watching others do the work, and ways to provide both individual and group instruction efficiently. If you are already using group activities in your classes or are interested in learning more about these techniques, this seminar should be helpful to you", "speaker": "Molly Johnson", "tag": "Teaching", "id": 83, "file_name": "cmu.andrew.org.utc.teaching-25_1"}, {"topic": "", "description": "Particularly if you teach in H&SS, you often see how students' writing skills greatly hinder or enhance their ability to convey their understanding of the subject matter of a course. In this seminar we will discuss how you can efficiently intervene and provide support to help your students improve their writing. You will receive handouts with different models for evaluating student papers to take into account both the quality of the writing and quality of their reasoning.", "speaker": "Elinore Long", "tag": "Teaching", "id": 84, "file_name": "cmu.andrew.org.utc.teaching-25_2"}, {"topic": "", "description": "Since Dan Quayle's famous Murphy Brown speech, many liberals have been jumping on the bandwagon to privilege the traditional heterosexual, two-parent, married-forever family. At the same time, increasing numbers of single women are choosing to have children, increasing numbers of lesbian and gay couples are choosing to have children, and increasing numbers of institutions are recognizing domestic partnership for people who cannot legally marry or who do not wish to. In this talk, Dr. Young will explore why we should be worried about traditional family values rhetoric, and engage in open discussion about the plural meanings of family for Americans today", "speaker": "Iris Young", "tag": "Education", "id": 85, "file_name": "cmu.andrew.org.win-10_0"}, {"topic": "POP Seminar", "description": "This talk describes paraML, extensions of ML which enable the user to utilise the advantages of the distributed memory style of architecture and the features of ML. The implementation is based on the SML/NJ and SML2C compilers. Some of the problems in implementing paraML for distributed memory multicomputers are solved by using the SML2C compiler. Other aspects of the project discussed include the design of primitives, implementation strategy, lessons learnt in the implementation, and future work.", "speaker": "Peter Bailey", "tag": "Engineering", "id": 86, "file_name": "cmu.cs.group.pop-53_0"}, {"topic": "POP Seminar", "description": "The introduction of sorts to first-order atomated theorem proving has brought a considerable gain in efficiency by reducing the search spaces, therefore it is desirable to be able to treat sorts in higher order theorem proving in a similar way. We present a sorted version of type theory; we extend the syntax and semantics of simple type theory by a higher order sort concept that includes term declarations. In our system the partial ordering on the base sorts induces a partial ordering on the higher types by covariance in the rangesort and the natural inclusion of base function sorts. We present a set of transformations for sorted (pre-) unification and prove the nondeterministic completeness of the algorithm induced by these transformations", "speaker": "Michael Kohlhase", "tag": "Engineering", "id": 87, "file_name": "cmu.cs.group.pop-55_0"}, {"topic": "Informal Talk", "description": "A classical and counterintuitive first theorem in complexity theory is that any set recognized in time f(n) can also be recognized in time 1/2 * f(n).  The technique---compressing pairs of tape symbols into single symbols over a larger alphabet---unfortunately does not extend to realistic programs. We prove for a realistic programming language that for any reasonable time bound f(n) [time-constructable] there is a constant a and a set L recognizable in time a * f(n) but not in time f(n). The key to the proof is a constant slowdown self-interpreter for a language of while programs that manipulate lists.", "speaker": "Neil D. Jones", "tag": "Engineering", "id": 88, "file_name": "cmu.cs.group.pop-58_0"}, {"topic": "POP Seminar", "description": "We present a general approach for constructing efficient proof search systems which is applicable to classical and some non-classical logics. In the first part of our talk we show how to build machine-oriented versions of logics using Maslov's inverse method. However a naive application of the inverse method results in inefficient proof search procedures. To make proof search more efficient one has to find strategies pruning the search space. To this end, in the second part of our talk, we show how to find such strategies for an abstract notion of deductive systems. Then we project abstract definitions to concrete logics, obtaining efficient strategies for them. We also show how one can obtain decision procedures for a class of logics using a combination of the strategies", "speaker": "Andrei Voronkov", "tag": "Engineering", "id": 89, "file_name": "cmu.cs.group.pop-63_0"}]