[
	{
    	"topic": "Radioactive Heaven And Earth",
    	"description": "The Environmental and Health Costs of Nuclear Weapons Production and Testing and Nuclear Waste Disposal.",
    	"speaker" : "Arjun Makhijani",
    	"tag": "Science",
    	"id" : "1",
    	"file_name": "cmu.andrew.org.heinz-1731_0"    
	},
	{
    	"topic": "On the Automated Differentiation of Computer Programs",
    	"description": "Automatic differentiation (AD) is a technique for augmenting computer programs with statements for the computation of derivatives. It exploits the fact that every program is a (potentially very long) sequence of elementary operations and employs the chain rule of derivative calculus to propagate these elementary derivatives. This technique is applicable to arbitrary computer programs containing branches, loops, and subroutine calls, and by exploiting the associativity of the derivative chain rule, derivatives can be computed potentially significantly less expensive (and more accurate as well) as with divided-difference computations, without tedious handcoding. We give an overview of the approach underlying the ADIFOR and ADIC automatic differentiation tools and their capabilities. ADIFOR, which has been developed in collaboration with Rice University, augments Fortran77 codes; ADIC augments ANSI-C codes. We present highlights of ADIFOR and ADIC applications and also of the SparsLinC library which is integrated with both ADIFOR and ADIC and enables one to transparently exploit sparsity in the computation of derivative matrices. Using SparsLinC, large sparse Jacobians can be computed efficiently, even without a-priori knowledge of the sparsity structure -- it is a byproduct of the derivative computation. It can also be shown that sparse computations underly the computation of gradients of functions with sparse Hessians and we present examples. Lastly, we briefly comment on the mathematical issues relating AD-generated derivatives to the 'do-what-I-mean' derivatives when AD is applied to iterative schemes, point out possibilities for parallelizing the derivative computation of serial codes by exploiting chain rule associativity, and point to directions of future research, for example with respect to generating adjoint-type derivative codes.",
    	"speaker" : "Christian Bischof",
    	"tag": "Engineering",
    	"id" : "2",
    	"file_name" : "cmu.andrew.org.epp-961_0"
	},
	{
    	"topic": "Electronic Data Interchange: Competitive Externalities and Strategic Implementation Policies",
    	"description": "Electronic Data Interchange (EDI) is an emerging type of standardized inter-organizational information system. In our seminar we discuss our current field work, and then analyze the strategic impact of the EDI technology on the upstream suppliers' competitive position in a hierarchical market structure with competing heterogeneous manufacturers. We show that a supplier's adoption of EDI can generate positive externalities for the buyer and negative (or competitive) externalities for other suppliers. As a result, the buyer provides a price premium to those suppliers who adopt EDI and increases their sales volume and market share. Moreover, when the benefits that the buyer can derive from implementing EDI are substantial, and the suppliers EDI adoption costs are high, it may be in the buyers best interest to subsidize the suppliers so as to encourage them to adopt EDI, instead of mandating them to do so. Regardless of whether the buyer employs a mandatory  or a subsidizing policy, the buyer and the end consumers may be the only ones who gain from this new technology. Consequently, a partial adoption by the supplier base may be optimal for the buyer when the suppliers adoption costs are sufficiently high. We also show that, while EDI reduces the transaction costs of the buyer, the upstream market tends to become more concentrated as a result of increased cost differentials. These results provide one economic explanation of the fact that many manufacturers have actually  reduced  their component suppliers base after implementing EDI, despite a significant reduction in their market transaction costs.",
    	"speaker" : "Abraham Seidmann",
    	"tag": "Teaching",
    	"id" : "3",
    	"file_name" : "cmu.andrew.org.epp-926_0"
	},
	{
    	"topic": "Use of Electron Microscopy for Metal Speciation in Soil and Dust",
    	"description": "RJ Lee Group is a company that spun off from USX Research, and that is focused on scanning electron microscopy technology. They  have developed a revolutionary product, a bench-top SEM, that is capable of counting, sizing, and doing elemental analysis on particles in its field of view along with providing a micrograph image. The company also undertakes basic and applied research projects that involve SEM analysis. A significant portion of these projects are related to environmental issues, e.g., characterization of particles in stack emissions, identification of asbestos, characterization of mineral particles. Dr. Kennedy will be discussing a project performed by RJ Lee that focused on characterization of contaminants in soil and dust associated with a Superfund site.",
    	"speaker" : "DR. STEPHEN KENNEDY",
    	"tag": "Science",
    	"id" : "7",
    	"file_name" : "cmu.andrew.org.epp-799_0"
	},
	{
    	"topic": "The Invisibility of Privilege:  The Intersection of Race and Gender",
    	"description": "Explore the assumptions and implications of privilege in institutions of higher education. Peggy McIntosh's White Privilege: Unpacking the Invisible Knapsack, which was found in the July/August 1989 issue of Peace and Freedom, serves as a basis of discussion.",
    	"speaker" : "Carla Gary",
    	"tag": "Teaching",
    	"id" : "8",
    	"file_name" : "cmu.andrew.org.epp-737_0"
	},
	{
    	"topic": "Environmental Integrity at the St. Johns Landfill: An Interdisciplinary Study",
    	"description": "Environmental Integrity",
    	"speaker" : "DR. WILLIAM FISH",
    	"tag": "Science",
    	"id" : "9",
    	"file_name" : "cmu.andrew.org.epp-709_0"
	},
	{
    	"topic": "Toxics Emissions Indices for Green Design and Inventory",
    	"description": "Toxics Emissions Indices for Green Design and Inventory",
    	"speaker" : "Mr. Arpad Horvath",
    	"tag": "Engineering",
    	"id" : "10",
    	"file_name" : "cmu.andrew.org.epp-703_13"
	},
	{
    	"topic": "Biodegradation of Naphthalene from Nonaqueous Phase Liquids",
    	"description": "Biodegradation of Naphthalene from Nonaqueous Phase Liquids",
    	"speaker" : "Mr. Subhasis Ghoshal",
    	"tag": "Engineering",
    	"id" : "11",
    	"file_name" : "cmu.andrew.org.epp-703_12"
	},
	{
    	"topic": "Dante II and Beyond:Exploration Robots",
    	"description": "Exploration Robots",
    	"speaker" : "Dr. John Bares",
    	"tag": "Science",
    	"id" : "12",
    	"file_name" : "cmu.andrew.org.epp-703_10"
	},
	{
    	"topic": "Modeling of In Situ Solvent Extraction of Coal Tar: Interrupted Pumping Process",
    	"description": "Modeling of In Situ Solvent Extraction of Coal Tar: Interrupted Pumping Process",
    	"speaker" : "Mr. Rajat Ghosh",
    	"tag": "Engineering",
    	"id" : "13",
    	"file_name" : "cmu.andrew.org.epp-703_9"
	},
	{
    	"topic": "The Role of the Environmental Engineer in Arbitration, Negotiation, and Litigation",
    	"description": "Role of the Environmental Engineer in Arbitration, Negotiation, and Litigation",
    	"speaker" : "Dr. Davis L. Ford",
    	"tag": "Engineering",
    	"id" : "14",
    	"file_name" : "cmu.andrew.org.epp-703_6"
	},
	{
    	"topic": "International Environmental Management Standards",
    	"description": "This presentation gives an overview of U.S. thinking on the development of international environmental management standards within ISO technical committee 207. Standards and guidelines are being created there on environmental management, auditing, life-cycle-assessment, labeling,performance evaluation, and product attributes. The potential effects of these standards on national and regional standards, trade, cost and benefits, environmental improvement, regulatory compliance, and harmonization with existing ISO 9000 Quality Standards  will be discussed.",
    	"speaker" : "Joe Cascio",
    	"tag": "Teaching",
    	"id" : "15",
    	"file_name" : "cmu.andrew.org.epp-592_0"
	},
	{
    	"topic": "Negotiated Management:  A Policy Proposal for Groundwater Pollution",
    	"description": "Mr. Walker will talk about how a policy of negotiated management may help to (a) improve interactions among the multiple stakeholders in a typical groundwater pollution problem and (b) to remedy the deficiencies in the current management of groundwater pollution. In this talk, he will discuss the development of SAM (Simulated Aquifer Management)and present a simulation of the negotiated management proposal for a hypothetial scenario. An extended abstract follows. There are widely-perceived deficiencies in the current management of groundwater pollution, in both Canada and the United States (e.g., Superfund). These deficiencies can be seen in terms of efficiency and equity. The efficiency problem concerns the disappointingly low environmental benefits obtained at high economic costs. The equity problem refers to unfairness in the societal distribution of disbenefits and benefits. One reason for these deficiencies may lie in counter-productive interactions among the multiple stakeholders involved in a typical groundwater pollution problem. These stakeholders include regulators, polluters, and affected parties. A policy of negotiated management may help both to improve these interactions, and to remedy the deficiencies. Under negotiated management, negotiation involving all stakeholders would be the dominant mode of interaction. Non-cooperative alternatives, such as litigation or imposed regulations, would be held in reserve. The geographic scope would encompass the entire area which is affected or potentially affected. The stakeholders would be jointly advised by a neutral technical consultant. Options which cope with uncertainty would be developed. The negotiation would repeat on a periodic basis, reflecting new information and changing circumstances. SAM (Simulated Aquifer Management) is a simulation of the negotiated management proposal, for a hypothetical scenario. The goal is to both develop and illustrate the proposal. SAM consists of representations of the groundwater system, the technical options, and the negotiation among stakeholders. The representations of the groundwater system and the technical options are based on computer models. Negotiation is represented with two complementary methods. The first method is based on game theory, and is implemented on the computer. The second method uses a game in which participants act out the roles of the stakeholders.",
    	"speaker" : "Mr. Dan Walker",
    	"tag": "Teaching",
    	"id" : "16",
    	"file_name" : "cmu.andrew.org.epp-571_0"
	},
	{
    	"topic": "The Cathedral of Learning: A Case Study of Materials Damage by Air Pollutants",
    	"description": "Materials Damage by Air Pollutants",
    	"speaker" : "MR. MICHAEL LUTZ",
    	"tag": "Teaching",
    	"id" : "17",
    	"file_name" : "cmu.andrew.org.epp-533_0"
	},
	{
    	"topic": "Oxidation-Reduction Processes at Oxide Surfaces in Relation to Water Quality",
    	"description": "Oxidation-Reduction Processes at Oxide Surfaces in Relation to Water Quality",
    	"speaker" : "J. Morgan",
    	"tag": "Teaching",
    	"id" : "18",
    	"file_name" : "cmu.andrew.org.epp-523_0"
	},
	{
    	"topic": "CONTAMINANT MIGRATION IN COMPLEX-STRUCTURE AND FRACTURED POROUS GEOLOGIC MEDIA:  A SIMULATION PERSPECTIVE",
    	"description": "The migration rates and spreading patterns of toxic chemicals in ground water systems are strongly influenced by the spatial variability of hydraulic parameters and chemical partitioning coefficients along individual flow paths. Recent strides in computational hydrogeology, together with advanced scientific visualization tools, now enable researchers to explore many of the salient issues at hand due to heterogeneity in unprecedented detail. Using this approach for gaining insight into the behavior of both dissolved and immiscible contaminants in complex ground water systems, the results of high-resolution numerical simulations of a variety of contemporary problems facing ground water scientists and engineers will be presented and discussed.",
    	"speaker" : "DR. EDWARD A. SUDICKY",
    	"tag": "Engineering",
    	"id" : "19",
    	"file_name" : "cmu.andrew.org.epp-486_0"
	},
	{
    	"topic": "Automobile Recycling: Trends and Policy Issues",
    	"description": "In this presentation, Dr. Curlee will give an overview of a recent DOE project that addressed the current and future viability of automobile recycling in the United States. More specifically, the presentation will focus on the energy, economic, and waste-quantity implications of maintaining the recycle status-quo, as well as potential moves to alternative technologies and approaches to recycle automobiles. The presentation also will summarize recent trends in automobile recycling in Europe and Japan and will discuss key policy issues that are likely to take 'center stage' in the coming decade.",
    	"speaker" : "Dr. Randall Curlee",
    	"tag": "Engineering",
    	"id" : "20",
    	"file_name" : "cmu.andrew.org.epp-475_0"
	},
	{
    	"topic": "Treatment of Fine Particles in Soil Washing Processes",
    	"description": "Treatment of Fine Particles in Soil Washing Processes",
    	"speaker" : "DAVID DZOMBAK",
    	"tag": "Engineering",
    	"id" : "21",
    	"file_name" : "cmu.andrew.org.epp-464_0"
	},
	{
    	"topic": "CURRENTS OF DEATH: is increased cancer near powelines a threat or a hoax?",
    	"description": "The possibility of health effects as a result of exposure to fields from power frequency sources has lead to a great deal of controversy over the last fifteen years or so here in the U.S. Are there legitimate concerns for those living near large transmission lines, or are in some way in unusual exposure situations? If there are risks, are they being covered up by the utility industry as some in the media might claim? Or, on the other hand, is this an issue which has been blown out of proportion by a story-hungry media? In this talk, I will first briefly review the physics of extra low frequency (ELF) electric and magnetic fields (sorry, the attention getting word 'radiation' is not technically correct!). I will describe some of the epidemiological, cellular, and whole animal studies in this area, and hopefully shed some light on why there is so much controversy. I will then look at some of the issues facing policy makers in light of a heavily politicized issue, and try to answer questions of media hype and cover-up. I will conclude by describing the method we have developed here for use by policy makers seeking to decide which mitigation strategies make sense to adopt.",
    	"speaker" : "Dr. Jack Adams",
    	"tag": "Science",
    	"id" : "22",
    	"file_name" : "cmu.andrew.org.epp-397_0"
	},
	{
    	"topic": "The On-Time Machines: Some Analyses of Airline Punctuality",
    	"description": "The Department of Transportation (D.O.T.) rates commercial airlines on-time performance every month, but its ratings may unfairly penalize airlines that fly disproportionately into airports at which it is inherently more difficult to land in on-time. We propose several rating methods that we consider more equitable and apply them to 36 months of D.O.T. data. Rating airlines promptness is an example of the more general problem of evaluating players who compete in overlapping but not identical sets of tournaments, where there is no exogenous knowledge about the quality of the players or the difficulty of the tournaments.",
    	"speaker" : "Jonathan Caulkins",
    	"tag": "Engineering",
    	"id" : "23",
    	"file_name" : "cmu.andrew.org.epp-382_0"
	},
	{
    	"topic": "The Environmental Consequences of the NAFTA",
    	"description": "The Environmental Consequences of the NAFTA",
    	"speaker" : "Michael Gregory",
    	"tag": "Engineering",
    	"id" : "24",
    	"file_name" : "cmu.andrew.org.epp-375_0"
	},
	{
    	"topic": "Competition Vs. Community: Building Equity in the Sciences, Math & Engineering",
    	"description": "Pathways is a longitudinal study about women in science and math: what attracts them and keeps them in these fields at critical stages in their lives. According to Rayman, four factors keep undergraduates engaged in science: parents, mentors, hands-on experience research, and career advice. In graduate school, the importance of mentors makes the difference.",
    	"speaker" : "Paula Rayman",
    	"tag": "Teaching",
    	"id" : "25",
    	"file_name" : "cmu.andrew.org.epp-344_0"
	},
	{
    	"topic": "Fogs and Heterogeneous Atmospheric Chemistry",
    	"description": "Atmospheric Chemistry",
    	"speaker" : "DR. SPYROS PANDIS",
    	"tag": "Science",
    	"id" : "27",
    	"file_name" : "cmu.andrew.org.epp-317_0"
	},
	{
    	"topic": "DESIGNING WASTE OUT",
    	"description": "During the past several decades, the United States has led the world in attention to the environment. While protection of the environment has become a national priority, it has been implemented by 'end of pipe' controls. The evolving strategy is pollution prevention, which is also referred to as 'green design'. Procter & Gamble's goal is to be a leader in this area. Mr. Lennert will describe his company's initial efforts in package and product design, which are already reaching the market, and will provide some perspectives on future developments in green design.",
    	"speaker" : "MR. DAVID A. LENNERT",
    	"tag": "Science",
    	"id" : "28",
    	"file_name" : "cmu.andrew.org.epp-303_0"
	},
	{
    	"topic": "Television Computing",
    	"description": "There is now a growing number of people who are coming to the realization that television computing is a radically new area for computing and a radically new  and imporant area for television. This presentation will describe the one concept: 'the Television Computer'. Let us imagin how it works and the world with it.Dr. Thibadeau has been working on this problem since 1988 and is currently a Principal Investigator for a DARPA program that has focused on computing and software architectures for broadcast High Definition Display Technology....like a home TV that is connected to a cable...where your TV becomes a giant computer terminal that is (on line) all the time. You're talking about very complex software here. It will change the landscape of computing.",
    	"speaker" : "Robert Thibadeau",
    	"tag": "Science",
    	"id" : "29",
    	"file_name" : "cmu.andrew.org.epp-82_0"
	},
	{
    	"topic": "Management of Innovation in Information Networking",
    	"description": "Information Networking",
    	"speaker" : "Dr. James C. Wetherbe",
    	"tag": "Science",
    	"id" : "30",
    	"file_name" : "cmu.andrew.org.epp-66_0"
	},
	{
    	"topic": "Wearable Computers: Concurrent Product Design and Rapid Prototyping",
    	"description": "Products of the future will be technologically more sophisticated, highly customized, produced in small batches, and brought to market more quickly than they are today. Their development will require an approach that integrates the four activities of the application, the artifact (i.e., hardware, software, mechanical structure, etc.,), the Computer-Aided Design (CAD) environment, and the physical prototyping facilities. This talk will outline recent advances by the NSF-sponsored Engineering Design Research Center at CMU in the design and prototyping of three generations of a novel class of computers, called wearable computers, which will be used as an illustration.",
    	"speaker" : "Dan Siewiorek",
    	"tag": "Engineering",
    	"id" : "31",
    	"file_name" : "cmu.andrew.org.epp-63_0"
	},
	{
    	"topic": "INI SPECIAL SEMINAR",
    	"description": "In order for the telecommunications companies to successfully function in a new world, become more market focused and competitive, companies must be able to creatively construct relationships and interact with other companies as both competitors and partners. Regulators will have to transition their role from one of the monitoring the costing and pricing of carriers to monitoring competitive entry conditions, service quality, and administer programs to help those who might otherwise be left behind.",
    	"speaker" : "Andrew C. Barrett",
    	"tag": "Business",
    	"id" : "32",
    	"file_name" : "cmu.andrew.org.epp-58_0"
	},
	{
    	"topic": "The Challenge of Electronic Markets",
    	"description": "Floor markets such as New York Stock Exchange and  Chicago Board of Trade are losing market share to electronic markets such as London Stock Exchange and INSTINET. Consequently, most exchanges have begun to design their own electronic trading systems. Such systems are still in their infancy. They must meet at least two major conflicting requirements of fairness and speed. Having failed to resolved this problem, all electronic systems to-date resort to prohibiting input from electronic traders into their systems. What will it take to create electronic markets that can handle input from electronic traders without disruption?",
    	"speaker" : "Shyam Sunder",
    	"tag": "Business",
    	"id" : "33",
    	"file_name" : "cmu.andrew.org.epp-55_0"
	},
	{
    	"topic": "MULTIMEDIA",
    	"description": "Roger Dannenberg will discuss the use of multimedia in the Piano Tutor project and support for synchronization and remote access to multimedia in the Tactus project. Plans for the future include a distributed system for intelligent multimedia-based tutoring. Mel Siegel will provide an overview of the Advanced Visual Display Systems Program, which is composed of three projects coordinated by Angel Jordan, (1) The Intelligent Frame Buffer (Bob Thibadeau), (2) Advanced Display Technologies (Peter Brody), and (3) 3D Stereoscopy Technologies (Mel Siegel), all of which are linked to a fourth separately funded project, (4) Dynamic Learning Environments, that will be described by Scott. Mel will expand on the 3D Stereoscopy Technologies portion, discussing some implementation alternatives and the reasons and implications of the approach selected",
    	"speaker" : "Roger Dannenberg",
    	"tag": "Teaching",
    	"id" : "34",
    	"file_name" : "cmu.andrew.org.epp-42_0"
	},
	{
    	"topic": "Northern Telecom Experience with Wireless PCS Business Communications Systems",
    	"description": "Personal, wireless device, together with new mobility management and call management capabilities will enable the creation of an unlimited range of new, valuable services and market opportunities.Initial focus will be on personal communications services on business premises which provide economically justifiable just-in-time communications benefits. Successful deployment of such services require in-depth market understanding, evolutionary product design that can meet present and future customer needs, and total system support to distributors and users for system installation, administration and maintenance. Northern Telecom has accumulated a wealth of experience through its participation in the development of wireless business systems markets globally - in Asia, Europe and America.The communication paradigm shift that PCS will create is challenging our industry - service providers, operating companies, manufacturers, standard bodies and regulators around the world as never before. One of the critical ingredients for success is availabilitiy of compatibility, evolutionary and competitive standards, which alow users to employ same personal devices in a variety of daily activities - at home, in the office or in public places, while enabling product and service economies of scale characteristic to mass market applications.",
    	"speaker" : "Dr. Sorin Cohn",
    	"tag": "Engineering",
    	"id" : "35",
    	"file_name" : "cmu.andrew.org.epp-21_0"
	},
	{
    	"topic": "Benchmarking Master's Programs in Professional Writing",
    	"description": "Dave will be discussing the results of his recent evaluation of master's programs in professional writing in the U.S. and professional writing in Japan.",
    	"speaker" : "Dave Kaufer",
    	"tag": "Teaching",
    	"id" : "36",
    	"file_name" : "cmu.andrew.org.english-1_0"
	},
	{
    	"topic": "Electronic Games and Interactive Multi-Media: A Power-Up for Math and Science Education",
    	"description": "Much of the excitement associated with the advent of inexpensive multi-media systems and the so-called information super-highway centers around the potential uses of these technologies for enhancing education. Many efforts are now underway to produce electronic games and other interactive multi-media applications to support math and science education in schools, especially for grades K-8. There are several reasons for this focus on math and science education. One is the urgent need to increase students interest and achievement in these subjects. In addition, electronic environments facilitate visualization, exploration, and manipulation of complex concepts and structures that are difficult to achieve with other methods or media. These efforts to produce applications that combine entertainment and education raise many basic questions about the effective design and use of such materials. Which user interfaces, formats, navigational structures, etc. work well with specific educational content? Which activities are attractive to most girls? to most boys? What are the most effective ways of using these materials in schools? in homes? This talk describes ongoing research on these issues in the E-GEMS project, a collaborative effort by computer scientists, education specialists, teachers, and professional game developers.",
    	"speaker" : "Maria Klawe",
    	"tag": "Teaching",
    	"id" : "39",
    	"file_name" : "cmu.andrew.org.cmu-hci-519_0"
	},
	{
    	"topic": "Belvedere: Supporting Critical Discussion of Science and Public Policy Issues",
    	"description": "We are experimenting with a learning environment, Belvedere, for supporting the development of scientific argumentation skills in young students. The design is intended to address the cognitive and motivational limitations of unpracticed beginners, as presented in the psychological literature and as we encountered them in formative testing with students. These limitations include (1) difficulty recognizing abstract relationships implicit in scientific theories and arguments, (2) difficulty focusing attention on particular problems encountered in the construction and evaluation of complex arguments, (3) lack of domain knowledge, and (4) lack of motivation. Belvedere addresses these limitations by (1 and 2) giving arguments a concrete diagrammatic form, (2) providing an automated, on-demand argumentation advisor, (3) providing access to on-line information resources; and (3 and 4) supporting students working in small groups to construct documents to be shared with others. A nontrivial portion of the critical discussion we seek to support takes place external to the software. Consequently, we cannot assume that optimization of support for secondary subtasks (such as the efficient construction of good argument diagrams) necessarily improves overall collaborative learning. Rather, we must evaluate features of groupware for learning in terms of how well they stimulate the right kind of activity in the total human-computer system.",
    	"speaker" : "Dan Suthers",
    	"tag": "Teaching",
    	"id" : "40",
    	"file_name" : "cmu.andrew.org.cmu-hci-518_0"
	},
	{
    	"topic": "Microsoft:  Rethinking the Process of Software Product Development",
    	"description": "This talk focuses on recent initiatives within the Microsoft Corporation to rethink conventional approaches to managing the development of large-scale software products, which now include many PC software products as well as systems for larger computers. It will summarize findings from a forthcoming book titled MICROSOFT SECRETS (Free Press, 1995), by Michael Cusumano and Richard Selby. In markets with rapidly evolving technologies and uncertain customer requirements, projects that follow a typical sequential or waterfall type of process will invariably be late and have many defects, and the designs probably will not effectively meet customer needs. Furthermore, as the size and complexity of products have grown, the number of people involved even in PC software projects has grown, creating another problem:  how to make large teams, which are now necessary to build software systems in relatively short periods of time, work like small teams -- which are the best way to build any complex product.A conventional waterfall process views product development as a sequential series of phases or steps that take developers from an initial high-level design through system testing and product shipment. In this approach, designers try to write a specification that is as complete as possible to reduce the need for unnecessary rework later on. They then divide the specification into pieces or modules in a more detailed design, and then assign different individuals or teams to build these pieces in parallel. Each team tests and debugs (finds and fixes errors) in its pieces. Only in the last phase of the project, which could range from a few months to a few years for a large system, do the designers, developers, and testers try to integrate the pieces and test the entire system. Invariably, the integration and system testing do not go well because the pieces of the product have significantly changed during the project. Moreover, these changes are almost always necessary to improve the design. Problems with the waterfall approach become even worse when many people are required to build a large-scale complex system product because of the difficulties that result in maintaining the integrity of the design as well as facilitating coordination and communication. Since 1989-1990, leading Microsoft projects, beginning with the Excel group, have been introducing a new process that we call synch and stabilize. The development team begins by outlining the product in sufficient depth to set priorities in terms of desired features but without trying to decide all the details of each feature. They divide the product and the project into parts (features and small feature teams), and divide the project schedule into three or four milestone junctures (sub-projects) of prioritized features. A series of small teams then goes through a complete cycle of development, testing, and debugging in each milestone phase. Moreover,  Microsoft scales up the small-team approach by having all members of all teams synchronize their work by building the product, and by finding and fixing errors, on a daily and weekly basis. When most serious problems are fixed, they stabilize (agree not to change) the most important pieces and proceed to the next milestone or to the ship decision.This process addresses a basic problem common to many firms in highly competitive, rapidly changing industries. Most new products can no longer be built by just two or three people; they require much larger teams. Furthermore, the members of the team build components that are interdependent but difficult to define accurately in the early stages of  the development cycle. In these situations, the project must find a way to proceed that structures and coordinates what individuals and individual teams do, while allowing them enough flexibility to evolve the product's features in stages during the development.",
    	"speaker" : "Michael A. Cusumano",
    	"tag": "Business",
    	"id" : "41",
    	"file_name" : "cmu.andrew.org.cmu-hci-499_0"
	},
	{
    	"topic": "Patterns in Object-Oriented Software",
    	"description": "The study of Patterns is not unique to software; indeed, the importance of patterns has long been recognized in other technical disciplines. In a matter of speaking, the field of software engineering is just beginning to awaken to the importance of patterns. Its importance represents a higher-leverage form of reuse. The search of patterns encompasses far more than finding the One Perfect Class; rather, it focuses upon identifying the common behavior and interactions that transcend individual objects.",
    	"speaker" : "Grady Booch",
    	"tag": "Engineering",
    	"id" : "42",
    	"file_name" : "cmu.andrew.org.cmu-hci-457_0"
	},
	{"topic": "Creativity:  The Key to Unlocking Interactive Multimedia's Potential",
    	"description": "The promise of mainstream interactive multimedia can be fulfilled when innovative, creative people produce useful, engaging titles that resonate with the ultimate set-top box -- the human mind. There has been much talk about the brave new world of interactive multimedia. While technology will drive this new industry, it is creativity which will transform it from technological curiosity to mainstream media. History reveals that success in any new media technology is built upon appealing content. Once a new medium's technology is mastered, the creation of information and entertainment that interests people is what takes that medium to the mainstream. That means creating interactive multimedia titles which are easy to use, powerful and entertaining. It means making the technology so transparent that it disappears. That is hard, but, like Willie Mays and Roberto Clemente, it means we have to make the hard things look easy. In this talk I'll discuss how my experience in many media has shaped the way I see multimedia's potential and guided me in building our multimedia production company. As a small example, I'll present a brief demonstration of our first product, MAGICAL MUSICLAND, an interactive title aimed at four- to eight-year-olds that places a symphony orchestra at their feet and invites them into a fun, mythical world.",
    	"speaker" : "Chip Walter",
    	"tag": "Teaching",
    	"id" : "43",
    	"file_name" : "cmu.andrew.org.cmu-hci-442_0"
	},
	{
    	"topic": "Beyond richness: The role of media attributes in the use and impact of communication technology",
    	"description": "The media richness hypothesis states that communication media with greater carrying capacity are especially suited for complex and equivocal tasks. For example, because a video phone is richer than electronic mail, it should be suitable for resolving organizational conflict, but would be overkill for transmitting factual information. Yet empirical support for the media richness hypothesis, while consistent, is weak. People frequently communicate over seemingly inappropriate media and accomplish their work using them. This talk uses several empirical studies of new media to examine how their attributes mesh with task characteristics to produce impact. It concludes that 1) media attributes indeed constrain task performance, but that interactivity and expressivness, not richness per se, are the important elements; 2) people frequently adapt to media contraints by changing the tasks they try to accomplish; and 3) the social norms surrounding a new medium may be as important as the objective characteristics of the medium itself in influencing the degree and style of use",
    	"speaker" : "Robert E. Kraut",
    	"tag": "Engineering",
    	"id" : "44",
    	"file_name" : "cmu.andrew.org.cmu-hci-429_0"
	},
	{"topic": "The Role of Visual Fidelity in Instructional Simulations",
    	"description": "The Software Engineering Institute made use of digital video in developing an interactive course teaching code inspections, a formalized group process for finding defects in software code. This course, titled 'A Cure for the Common Code', is interactive in that the student not only learns about but also participates in code inspections.Digital video systems offer a wide spectrum of interface capabilities, allowing the fidelity of 'A Cure for the Common Code' to vary from that of a home arcade game with simple graphics and slide show presentations to a visually rich display complete with full motion video. Photographic images of an office setting and professional video of actors playing the roles of fellow workers can make the learning environment both engaging and realistic to the student. However, is there any instructional benefit to increasing the visual fidelity of the environment?  'A Cure for the Common Code' was used in a formal experiment to address this question, and more specifically to address the following:- what role does the frame rate of visual material play in the students perception of and ability to recall presented information?- does the use of surrogate travel, rather than a single image,  point-and-click navigation interface, have any effect on student recall and perception of presented material?This talk will briefly overview the code inspection course, and then discuss the results of the formal experiment concerning visual fidelity in interfaces.This work is among the first to explore the unique interface opportunities which digital video offers, and a set of guidelines will be proposed based upon this research.",
    	"speaker" : "Michael Christel",
    	"tag": "Teaching",
    	"id" : "45",
    	"file_name" : "cmu.andrew.org.cmu-hci-420_0"
	},
	{
    	"topic": "Extending an Embedded Object Architecture to Support Collaborative Work",
    	"description": "For several years, the notion of User Interfaces that support embedded objects has been gaining popularity, culminating in the recent OLE work from Microsoft and the OpenDoc architecture from CIL. These are systems where active objects (text , spreadsheets, pictures, etc. ) are not simply isolated applications, but are components that can include one another, allowing both the users and application creators to develop multi-media documents that can present information in a variety of ways. This talk will discuss some attempts to extend an embedded object system to support collaborative editing, focusing on the system features that lend themselves to producing groupware, and those that make groupware difficult. The goals for this system include not only interactive document creation, but also interactive application creation and the ability to give remote software demonstrations. Included in this talk will be a discussion of early work using a single process model (as in the Argo system), and more recent work which supports multiple processes that share data through a  back-end which is both UI and system independent. A file-based interface to this back-end has been implemented, and an interface based on the HyperDesk Distributed Object Management System is currently in the works at Mitre, who has been supporting this recent work",
    	"speaker" : "Tom Neuendorffer",
    	"tag": "Engineering",
    	"id" : "46",
    	"file_name" : "cmu.andrew.org.cmu-hci-411_0"
	},
	{
    	"topic": "The Rendezvous Language and Architecture for Constructing Multi-User Applications",
    	"description": "When people have meetings or discuss things, they frequently use conversational props: physical models, drawings, or other concrete representations of information used to enhance the exchange of information in the conversation. If the participants are geographically separated, it is difficult to make effective use of props since each physical prop can only exist in one place. Additionally, with the increasing use of personal computers and workstations, many of the things that people may wish to talk about might not exist physically (e.g., computerized spreadsheets and CAD drawings). These two factors suggest that computer applications allowing two or more users to simultaneously view and manipulate the same data might be useful to augment human-to-human telecommunication. We have built the Rendezvous language and architecture to aid the construction of applications to be used as conversational props. Based on experience with several large applications built with the Rendezvous tools, we believe that they are an effective set of tools for building conversational props and other computer-supported cooperative work (CSCW) applications. We present a list of required features of conversational props, some example applications built with the Rendezvous tools, and a description of the Rendezvous tools.",
    	"speaker" : "Ralph D. Hill",
    	"tag": "Engineering",
    	"id" : "47",
    	"file_name" : "cmu.andrew.org.cmu-hci-405_0"
	},
	{
    	"topic": "Doing Real Science in Virtual Reality",
    	"description": "Virtual Reality, like Artificial Intelligence, is an oxymoron that has captured the public's eye and created unrealistic expectations. Amid the hype, some researchers are making solid progress examining immersive environments. At the University of Virginia, we have an interdisciplinary team of over twenty researchers pursuing Virtual Reality as both an advanced form of HCI and as a new medium for communication.This talk will describe our software architecture and the scientific experiments we have built using it. The software architecture consists of two pieces: Alice & DIVER. Alice is an interpreted, object-oriented rapid prototyping environment, providing one second turn-around time for changes to virtual environment programs. DIVER is the lower-level graphics rendering system responsible for maintaining graphics update rates and device context. These systems allow rapid, exploratory design with clients from architecture and psychology, without sacrificing system performance. We will present two examples of scientific experiments built using the system. The first experiment measures search task performance in immersive virtual environments versus traditional desktop displays. The second experiment measures a perceptual phenomena where people tend to over-estimate the steepness of hills. In the second experiment we were able to replicate and extend results from measurements independently taken with real hills, providing some level of confidence in the fidelity of our virtual environment stimuli for this task. The talk will conclude with a discussion of the challenges that must be addressed before many virtual environment applications will be feasible. These challenges include correctly registering the visual cues with the proprioceptive signals, measuring the effects of virtual environments on the perceptual system, and identifying the utility and constraints of the medium",
    	"speaker" : "Randy Pausch",
    	"tag": "Science",
    	"id" : "48",
    	"file_name" : "cmu.andrew.org.cmu-hci-388_0"
	},
	{
    	"topic": "Interfaces that Learn",
    	"description": "One can easily imagine a broad range of personally customized software agents to assist us in our day-to-day work. For example, one could develop intelligent software agents to assist a university students and employees in scheduling meetings, hosting seminar speakers, making travel plans, reserving meeting rooms, organizing courses, etc. It seems the proliferation of such systems in practice will be bounded by the cost of developing and customizing them to the needs of each individual user. This talk presents research toward removing this bound, by building software agents that learn automatically to customize themselves to their users.More specifically, this talk presents a prototype software agent for calendar management that is currently in routine use by a handful of people, and that learns about their individual scheduling preferences. This system (called CAP) assists in scheduling meetings and provides advice regarding parameters such as the meeting time, duration, topic, and location. CAP uses each new meeting added to the calendar as a training example from which to learn, with the goal of evolving from an editor into a competent assistant. We present experimental results showing the effect of learning over the past two years while the system has been in routine use",
    	"speaker" : "Tom M. Mitchell",
    	"tag": "Engineering",
    	"id" : "49",
    	"file_name" : "cmu.andrew.org.cmu-hci-385_0"
	},
	{
    	"topic": "Access to Mathematics Through Speech",
    	"description": "Mathematics is generally communicated in a written form. That means that anyone with a visual disability is seriously disadvantaged. An alternative, non-visual representation must be used. Braille is one possibility, but has a lot of disadvantages and therefore synthetic speech can be used. Speech is also not as straightforward as might be assumed; a lot of information has to be encoded unambiguously and the user must have a means of controlling the flow of information.This talk will describe Mathtalk, a Tex-based program which attempts to address some of these issues. Many of the design principles derived have a wider significance; it is planned to apply them to a speech-based program browser to other non-visual interfaces",
    	"speaker" : "Robert Stevens",
    	"tag": "Teaching",
    	"id" : "50",
    	"file_name" : "cmu.andrew.org.cmu-hci-377_0"
	}
]

